/*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*/

'use strict';
const { WorkloadModuleBase } = require('@hyperledger/caliper-core');
const texts = ['对绳索和夜班工作状态的讨论','对方追问措施和报告的情况，责备对方没有解决问题','检修人员报告电缆问题','询问对方是否需要夜班并讨论缺绳房的问题','谈论修皮带、链子以及车辆','咨询设备故障和工作安排的问题','交流关于速度和带货的问题','讨论关于水钻机和灌笼的问题'];
/**const texts = ['问一下这个快活绳还没走勾刚才刚那个夜班接班的到上边，喂，对他没走勾你要让他赶紧给，没人干活快成好使，没有人没人干活呗中班时候修护搁那干活呢修护管你问要看你干，叫上边给开下开下快活绳好吧北二有人了你北二就开绞车没有人吗刚下来过了那不回王怀这几等接班来几等接班，夜班的夜班的夜班的，管我知道了你尽量让他联系一家伙啊尽量联系一家伙啊，你那二五书上，机头对，管我知道了，好这开车注意安全那是的先开车开车干活再开好。',
    '喂那个换封总的停区站的措施搁哪了可是马上拼的上午应该拼好了呗，你别应该你该给谁打电话给谁打电话你问以后看朱云豪他给人家那个通风调度抓紧送一回去现在送是吧对现在就得送人没有措施你报告报告你没批措施已经批好了你也不给人送你打电话问管子邦措施措施在哪了如果是，没有措施没有报告你该给工作量打电话对该问怎么弄怎么弄我靠你这屌啥煤机长我靠你到底还你说停人绳得给通风调度说靠停人绳调度室主备局你停人绳说的靠俺没见报告没有措施你不管。',
    '喂哎我查院长，我在幺零四车面怎么样查的怎么样了我现在水压喉都打开了没阀电压问题就外边有一段那个大电缆离那个小线子进的响切的进的响我一会催我给他放下来，你给他放下来我靠今天一上午闪了三回一上走勾他四个人走勾我靠，一下午一上午闪了三回了管我给他落下来看对他这个东西昨天就有这个问题了明天就打不过他们换新电了对你因为他你不是打不过换新电的问题你要中班再影响闪断了工作面到时候那你就跑不掉了可知道我叫外边早班不生产咱什么都好说可知道，我叫外边大电来给他放下来对好嗯，哎好。',
    '喂，你晚上还夜吗看见明天有试药好，奥走不让你搁这缺绳房不让他双给你甩行吧请弄哪个缺绳房不呀，乘人下口那边，啊好，奥七吨车占了八队，不是在你摇摆人没带个锁样吗两个时间都，冻着了吗到时候八点多吗你拿过来吧，奥这样吗这样吗你看着不看着的给吗啊给都克一无所谓啊好，不想直接陪着工作了吗，啊，我咋不慧搁你这我这定飞搁你就是定光，啊，你搁井锅下吧，就不给你割了啊，哎我说的没够你讲你那两天是不是洗液错了，你给我保护那问题来，你说哪接头，你保险的问题剩下机师傅记二做副座落班那个的记二做，你还卸的就是那样，你看你这链斜着都斜着么那是为一家伙堆二三四走咱们整轨堆着走那总有个弄你不放下明天再让我问你，那边有剩下得做不继续做胡子裸板，奥那记就日伟记这一会一堆的还是咱们这一波的，不进去了你还写的就是这了我这是哪家伙给你啊你别让人明天这样有风等你了，好咋请弄请弄讲了啊不打扰你了奥克猛请弄啊。',
    '哎啊，华哥给你掐的你把我皮带重水质在我里边里了得了，留一刀，离的远我搁下皮带去是离的了都到着质皮带的时候来，连的很厉害了，好你他说克链子来下来你吹斗的车皮他是都翻过来的你快不用开来，这回别说了那是，你可不知道他队现在正，呃强打直接了，就这他刚才给忘他了他说他搁七队领的你喊了我皮重水裂的了，你开一给他吹斗的这区再堵反会来，这刚才开的时候不嗯不带我回，上来不打一钩给你比度一下给你锁车你给开了你们，你搁那搁那来是来是人家就人家给我开吧哎，喂定轨哎，还是不行了不一定李头伟跑边保护送了吗你都给我装了，你那个弄后来，恢复那没有，你弄你弄水你给他讲开了你说弄回头弄，你刚才你刚才那个煤滴了，上边上滴快离开了就底下滴在这里吗，那是，下一波二波，下不吗，水压不，他说那能够煤磷钢筋那能皮带就从水里子了吗，就那地方是我自己的尾牙，那他定注给开的时候那没有办法弄，一会都停了吗弄的就漏在搁拉水了看着，八九八十里啊，老子搁八七零里，我联系他的，他不啊，八七零，两，哦小龙搁这来耳部弄开了吗，弄下来弄下来，行了行了你搁高车钩安装皮带来吗，哦好嘞好嘞嗯，啊。',
    '喂你好对张哥，哦啊，得走不带走，你给他打个电话你给我给他个，攻击了大奥还是，量车下了，弄样还是明儿明儿换呀，你等下你别挂哦，不见打电话主控机会割，不慌七波新巷啊，是啥原因的，就光熄火一拉吗，你给我写点单子，现在这每车估计人联系上是明天才弄的，他走光机也没亮起，嗯这几个料弄的，等一会我地矿底下打电话，不回了，我现在给他打，打电话出去下面，嗯师傅你那个手刹坏了啊，周红旗，注控器坏了，你叫他给我大的矿下点火了我问刚才他说的这时候现在十点半干了几排知道了，十阶段改了几趴一块，也跑一什么大支的，你看一排还没打的，割出来两排割出来两排吗，他出来也拍他就停在里头他在这边讲不给就那些补水打的，奥一排明哥，你这看够大架点火了吧吗，啊小哥，这边，哎师傅，你叫他大车叠火来吧给，没事没事他说他明天再下吧现在下的也拎不下不了，够，最后最后你给我割，嗯谁在下边现在张云刚是吧，嗯打个，奥下了，你师傅我，你是这个八二几工还是三十八二几工八，对我搞他们机巷工奥。',
    '喂啊你不能吃慢速可带货啊你不能吃慢速可带货你吃快速，十块数啊我前边没车我打给你十块数啊你不说十块数是你谁啊，我一边正下着来啊，前边还没看着呢你只能慢速了你怎么还做个皮带帮这个傻理的作业了吗，往那个往那个当就是跑偏钩的地方那上面一钩闸一钩接漏带的上了不见把带子卷了一起了，那你干啥的干啥意思你过了十分钟开你快送，我是说你一会到机头了吗那你没找人去机电房里昨天咋弄的，你们等一会儿再生产完事了吗我们到时候没生产车皮到时候没生产啊，哪来车皮没生产啊我知道那你们有货半个多小时不也开不了吗，喂。',
    '哎钩队啊，不是 钩地下啊，我都在外边修车修咧你让他赶紧接个电话咱们那个咱们领导要跟他通话，好了嗯挂了，啊，一会做大罐一会做小罐的他到底，那个打关喷，这个跑空罐你刚才，我让我送他过去送上去再不送上去再不送上去再不，喂哎是搞队是吧嗯哎我组造组的徐大长嗯你这个灌笼是怎么回事灌笼奥就灌笼上面几个，液压值那个额不七个来的，制度系统有点故障，你给调度室汇报了吗，额汇报了，这个我跟你说刚才这个大罐怎么是空巷现在是刚才啊刚才我是这个大罐，让我多打关打关突然又上去了，突然又上去了刚才是那个小怪物上来给处理了一会又，我了我师傅这个水钻机这个小关从今天坏的，高辉高辉，刚坏是吧这一个你下这个下把钩是几个人现在，几个司机就是啊，呃陈龙，我说你下边，就是一水平的矸，下边一个，整个就一个是吧哦夜班就一个人夜班一个人然后边两个是吧嗯，你现在这个这个小关也使关吗，就是你，这个修好以后也试吧就直接就开是吧嗯，试了，你试什么了我现在你根本没试，高拆那个呃你哪一个高拆的那个呃，呃刚才这个叫这个是这我你说你没事管，对，我一直在现场你一会沾上一会拿下你根本没事管弄直接上来了，你这个是不对的，奥你不用管啊我跟你说这一个我给我知道明天我就汇报啊，你跟他说你这个这样就这种干法吗，你一会这样他到底什么毛病你到底什么问题你自己内部的，我一会给让队长给他打电话吧，这个制度系统给我找那个什么要处理好了，你我跟你说你自己自己怎么说都行但是别人不理解知道吧，你没按规定制度把，就这样吧好，你说的。',
    ];**/
const size = [22, 24, 26, 28, 30, 35, 40, 45, 50, 55];
const owners = ['张山', '李四', '王二', '赵可', '程月', '胡宾', '吴所', '王健康', '姜家其', '刘大'];
const appraisedValue=[100,200,300,400,500,600,700,800,900,1000];
/**
 * Workload module for the benchmark round.
 */
class CreateCarWorkload extends WorkloadModuleBase {
    /**
     * Initializes the workload module instance.
     */
    constructor() {
        super();
        this.txIndex = 0;
    }

    /**
     * Assemble TXs for the round.
     * @return {Promise<TxStatus[]>}
     */
    async submitTransaction() {
        let Coaltext = texts[(this.txIndex) % texts.length];
        this.txIndex++;
        let textNumber = 'Client' + this.workerIndex + 'x' + this.txIndex.toString();
        let carSize = size[Math.floor(Math.random() * size.length)];
        let textOwner = owners[Math.floor(Math.random() * owners.length)];
        let textAppraisedValue = appraisedValue[Math.floor(Math.random() * appraisedValue.length)];

        let args = {
            contractId: 'basic',
            contractVersion: 'v1.0.1',
            contractFunction: 'CreateAsset',
            contractArguments:[textNumber, Coaltext, carSize.toString(), textOwner, textAppraisedValue.toString()],
            timeout: 30
        };

        await this.sutAdapter.sendRequests(args);
    }
}

/**
 * Create a new instance of the workload module.
 * @return {WorkloadModuleInterface}
 */
function createWorkloadModule() {
    return new CreateCarWorkload();
}

module.exports.createWorkloadModule = createWorkloadModule;
